car_gallery_api/app/controllers/api/v1/cars_controller.rb

INSERT INTO "cars" ("year", "make", "model", "image", "category_id") VALUES (?, ?, ?, ?, ?)  [["year", 12345], ["make", "make"], ["model", "model"], ["image", "123456"], ["category_id", 1]]
INSERT INTO "cars" ("year", "make", "model", "image", "likes", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["year", 123], ["make", "make"], ["model", "model"], ["image", "123"], ["likes", 0], ["category_id", 1]]
UPDATE "cars" SET "likes" = ?, "dislikes" = ? WHERE "cars"."id" = ?  [["likes", 0], ["dislikes", 0], ["id", 15]]
---
    def create
        @car = Car.create(car_params)
        @car.likes = 0
        @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "cars" SET "likes" = ?, "dislikes" = ? WHERE "cars"."id" = ?  [["likes", 0], ["dislikes", 0], ["id", 18]]
---
    def update
        @car = Car.find_by_id(params[:id])
        @car.update(likes: @car.likes + 1)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 8]]
---
    def destroy
        @car = Car.find_by_id(params[:id])
        @car.destroy